using System;
using System.Collections.Generic;
using System.IO;

namespace lab14i
{

    public class Program
    {
        static void Main(string[] args)
        {
            // Земля (Queue)	Континент (Dictionary)
            /*
                Выполнить запросы функции (всего должно быть выполнено не менее 5 запросов):
                c)	Использование операций над множествами (пересечение, объединение, разность).
                d)	Агрегирование данных.
                e)	Группировка данных 

                Запросы должны быть выполнены двумя способами:
                a)	С использованием LINQ запросов.
                b)	С использованием методов расширения.

                Каждый запрос выполняется в отдельной функции.
                Примеры запросов (лабораторная работа №10).
            */
            new Lab().Start();           
        }
    }
}